const quizQuestions = [
  {
    question: "Как называется основной закон Российской Федерации?",
    options: ["Федеральный закон", "Конституция", "Декларация", "Кодекс"],
    correctAnswer: 1,
    explanation:
      "Конституция РФ — высший нормативный правовой акт РФ. Она имеет высшую юридическую силу",
  },
  {
    question:
      "С какого возраста гражданин РФ может в полном объёме осуществлять свои права и обязанности?",
    options: ["С 16 лет", "С 18 лет", "С 21 года", "C 14 лет"],
    correctAnswer: 1,
    explanation:
      "Согласно гражданскому заканодательству РФ права и обязанности возникают с 18 лет",
  },
  {
    question:
      "Кто является гарантом Конституции РФ, прав и свобод человека и гражданина?",
    options: [
      "Председатель Правительства РФ",
      "Председатель Конституционного суда",
      "Президент РФ",
      "Генеральный прокурор",
    ],
    correctAnswer: 2,
    explanation:
      "Согласно Конституции РФ, Президент является гарантом прав и свобод человека и гражданина",
  },

  {
    question: "Сколько разделов содержит Конституция РФ?",
    options: ["Один", "Два", "Три", "Четыре"],
    correctAnswer: 1,
    explanation: "Конституции РФ, содержит два раздела",
  },

  {
    question: "Какая форма правления установлена в Российской Федерации?",
    options: ["Монархия", "Республика", "Олигархия", "Теократия"],
    correctAnswer: 1,
    explanation:
      "Согласно Конституции РФ, в России установлена республиканская форма правления",
  },

  {
    question:
      "Кто временно исполняет обязанности Президента РФ, если он не в состоянии их выполнять?",
    options: [
      "Председатель Совета федерации",
      "Председатель государственной думы",
      "Председатель правительства РФ",
      "Министр обороны РФ",
    ],
    correctAnswer: 2,
    explanation:
      "Согласно Конституции РФ, Председатель правительства может исполнять обязанности Президента",
  },

  {
    question: "На какой срок избирается Президент РФ?",
    options: ["На 4 года", "На пять лет", "На шесть лет", "На семь лет"],
    correctAnswer: 2,
    explanation: "Согласно Конституции РФ, Президент изберается на 6 лет",
  },

  {
    question:
      "Что является высшим представительным и законодательным органом РФ?",
    options: [
      "Правительство РФ",
      "Федеральное собрание",
      "Конституционный суд",
      "Генеральная прокуратура",
    ],
    correctAnswer: 1,
    explanation:
      "Согласно Конституции РФ, Федеральное собрание является высшим законодательным и представительным органом",
  },

  {
    question: "Сколько раз подряд может избираться Президент РФ?",
    options: [
      "Неограниченное количество",
      "Два раза",
      "Три раза",
      "Четыре раза",
    ],
    correctAnswer: 1,
    explanation:
      "Согласно Конституции РФ, Президент РФ может быть избран два раза подряд",
  },

  {
    question:
      "Как называется всенародное голосование по важнейшим вопросам государственной жизни?",
    options: ["Выборы", "Референдум", "Плебесцит", "Опрос"],
    correctAnswer: 1,
    explanation: "Референдум является всенародным голосованием",
  },

  {
    question: "Кто в РФ не имеет права избирать и быть избранным?",
    options: [
      "Несовершеннолетние",
      "Недееспособные и заключённые в местах лишения свободы",
      "Лица без гражданства",
      "Все перечисленные категории",
    ],
    correctAnswer: 1,
    explanation:
      "Недееспособные и заключённые в местах лишения свободы поражены в правах",
  },

  {
    question: "Какое образование в РФ является обязательным?",
    options: [
      "Начальное общее",
      "Основное общее",
      "Среднее общее",
      "Среднее профессиональное",
    ],
    correctAnswer: 1,
    explanation: "Основное общее образование является обязательным в РФ",
  },

  {
    question: "Кто должен заботиться о нетрудоспособных родителях?",
    options: [
      "Государство",
      "Благотворительные организации",
      "Местные органы самоуправления",
      "Трудоспособные дети, достигшие 18 лет",
    ],
    correctAnswer: 3,
    explanation:
      "Согласно семейному законодательству, о нетрудоспособных родителях должны заботиться трудоспособные дети, достигшие 18 лет ",
  },

  {
    question: "На какие ветви делится власть в РФ?",
    options: [
      "Законодательная, исполнительная, судебная",
      "Федеральная, региональная, местная",
      "Центральная, территориальная, муниципальная",
      "Политическая, экономическая, социальная",
    ],
    correctAnswer: 0,
    explanation:
      "Согласно Конституции РФ, ветви влвсти делятся на законодательную, исполнительную и судебную",
  },

  {
    question: "Может ли какой либо закон противоречить Конституции РФ?",
    options: [
      "Да, в особых случаях",
      "Да, если это Федеральный закон",
      "Нет, ни при каких обстоятельствах",
      "Да, если его утвердит Президент",
    ],
    correctAnswer: 2,
    explanation: "Конституции не может противоречить ни один закон",
  },
];
